In [12]:
#Imported panda, numpy, matplotlib.pyplot, and seaborn libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns 
%matplotlib inline
sns.set()

In [13]:
bom = pd.read_csv('datauz/bom.movie_gross.csv')
bom.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [14]:
bom.info()
bom.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
title             3387 non-null object
studio            3382 non-null object
domestic_gross    3359 non-null float64
foreign_gross     2037 non-null object
year              3387 non-null int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

In [15]:
imdbname = pd.read_csv('datauz/imdb.name.basics.csv')
imdbname.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [16]:
imdbname.info()
imdbname.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
nconst                606648 non-null object
primary_name          606648 non-null object
birth_year            82736 non-null float64
death_year            6783 non-null float64
primary_profession    555308 non-null object
known_for_titles      576444 non-null object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

         birth_year   death_year
count  82736.000000  6783.000000
mean    1967.043826  2000.523367
std       22.122190    43.951530
min        1.000000    17.000000
25%     1957.000000  2001.000000
50%     1971.000000  2013.000000
75%     1981.000000  2016.000000
max     2014.000000  2019.000000

In [17]:
#Exploring all the data from IMDB
imdbbasics = pd.read_csv('datauz/imdb.title.basics.csv')
imdbbasics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [18]:
imdbbasics.info()
imdbbasics.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
tconst             146144 non-null object
primary_title      146144 non-null object
original_title     146123 non-null object
start_year         146144 non-null int64
runtime_minutes    114405 non-null float64
genres             140736 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

          start_year  runtime_minutes
count  146144.000000    114405.000000
mean     2014.621798        86.187247
std         2.733583       166.360590
min      2010.000000         1.000000
25%      2012.000000        70.000000
50%      2015.000000        87.000000
75%      2017.000000        99.000000
max      2115.000000     51420.000000

In [19]:
imdbprincipals = pd.read_csv('datauz/imdb.title.principals.csv')
imdbprincipals.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [20]:
imdbprincipals.info()
imdbprincipals.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
tconst        1028186 non-null object
ordering      1028186 non-null int64
nconst        1028186 non-null object
category      1028186 non-null object
job           177684 non-null object
characters    393360 non-null object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

           ordering
count  1.028186e+06
mean   4.739847e+00
std    2.747446e+00
min    1.000000e+00
25%    2.000000e+00
50%    4.000000e+00
75%    7.000000e+00
max    1.000000e+01

In [21]:
imdbcrew = pd.read_csv('datauz/imdb.title.crew.csv')
imdbcrew.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [22]:
imdbcrew.info()
imdbcrew.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
tconst       146144 non-null object
directors    140417 non-null object
writers      110261 non-null object
dtypes: object(3)
memory usage: 3.3+ MB

           tconst  directors    writers
count      146144     140417     110261
unique     146144      98525      91920
top     tt9027998  nm3266654  nm0000636
freq            1         62         80

In [23]:
imdbratings = pd.read_csv('datauz/imdb.title.ratings.csv')
imdbratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [24]:
imdbratings.info()
imdbratings.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
tconst           73856 non-null object
averagerating    73856 non-null float64
numvotes         73856 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

       averagerating      numvotes
count   73856.000000  7.385600e+04
mean        6.332729  3.523662e+03
std         1.474978  3.029402e+04
min         1.000000  5.000000e+00
25%         5.500000  1.400000e+01
50%         6.500000  4.900000e+01
75%         7.400000  2.820000e+02
max        10.000000  1.841066e+06

In [25]:
imdbakas = pd.read_csv('datauz/imdb.title.akas.csv')
imdbakas.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [26]:
imdbakas.info()
imdbakas.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
title_id             331703 non-null object
ordering             331703 non-null int64
title                331703 non-null object
region               278410 non-null object
language             41715 non-null object
types                168447 non-null object
attributes           14925 non-null object
is_original_title    331678 non-null float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

            ordering  is_original_title
count  331703.000000      331678.000000
mean        5.125872           0.134769
std         6.706664           0.341477
min         1.000000           0.000000
25%         1.000000           0.000000
50%         2.000000           0.000000
75%         6.000000           0.000000
max        61.000000           1.000000

In [27]:
tmdb = pd.read_csv('datauz/tmdb.movies.csv')
tmdb.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [28]:
tmdb.info()
tmdb.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
Unnamed: 0           26517 non-null int64
genre_ids            26517 non-null object
id                   26517 non-null int64
original_language    26517 non-null object
original_title       26517 non-null object
popularity           26517 non-null float64
release_date         26517 non-null object
title                26517 non-null object
vote_average         26517 non-null float64
vote_count           26517 non-null int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

        Unnamed: 0             id    popularity  vote_average    vote_count
count  26517.00000   26517.000000  26517.000000  26517.000000  26517.000000
mean   13258.00000  295050.153260      3.130912      5.991281    194.224837
std     7654.94288  153661.615648      4.355229      1.852946    960.961095
min        0.00000      27.000000      0.600000      0.000000      1.000000
25%     6629.00000  157851.000000      0.600000      5.000000      2.000000
50%    13258.00000  309581.000000      1.374000      6.000000      5.000000
75%    19887.00000  419542.000000      3.694000      7.000000     28.000000
max    26516.00000  608444.000000     80.773000     10.000000  22186.000000

In [29]:
#Import tn dataset originally (https://www.the-numbers.com/movie/budgets/all)
tn = pd.read_csv('datauz/tn.movie_budgets.csv')
tn.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [30]:
tn.info()
tn.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

                id
count  5782.000000
mean     50.372363
std      28.821076
min       1.000000
25%      25.000000
50%      50.000000
75%      75.000000
max     100.000000

In [31]:
#converting production_budget, domestic_gross, and worldwide_gross from objects to int values
#converting release_date from obejct to datetime value
tn.production_budget = tn.production_budget.replace('[\$,]', '', regex=True).astype(int)
tn.domestic_gross = tn.domestic_gross.replace('[\$,]', '', regex=True).astype(int)
tn.worldwide_gross = tn.worldwide_gross.replace('[\$,]', '', regex=True).astype(int)
tn.release_date = pd.to_datetime(tn.release_date)

In [32]:
tn.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null datetime64[ns]
movie                5782 non-null object
production_budget    5782 non-null int64
domestic_gross       5782 non-null int64
worldwide_gross      5782 non-null int64
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 271.2+ KB

In [33]:
tn.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,2009-12-18,Avatar,425000000,760507625,2776345279
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,3,2019-06-07,Dark Phoenix,350000000,42762350,149762350
3,4,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747

In [34]:
#created international_gross variable to assist in seeing success internationally compared to domestically
tn['international_gross'] = tn.worldwide_gross - tn.domestic_gross
tn.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,international_gross
0,1,2009-12-18,Avatar,425000000,760507625,2776345279,2015837654
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,804600000
2,3,2019-06-07,Dark Phoenix,350000000,42762350,149762350,107000000
3,4,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,944008095
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,696540365

In [35]:
#created profit variable to show overall success of movie, which is determined by how much profit it made
tn['profit'] = tn.worldwide_gross - tn.production_budget
tn.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,international_gross,profit
0,1,2009-12-18,Avatar,425000000,760507625,2776345279,2015837654,2351345279
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,804600000,635063875
2,3,2019-06-07,Dark Phoenix,350000000,42762350,149762350,107000000,-200237650
3,4,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,944008095,1072413963
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,696540365,999721747

In [36]:
#creating subset of tn dataset to use movies only from 2010-2018
tn_2010_2018 = tn[(tn.release_date >= '2010-01-01') & (tn.release_date <= '2018-12-31')]
tn_2010_2018.release_date.describe()

count                    2124
unique                    692
top       2014-12-31 00:00:00
freq                       24
first     2010-01-08 00:00:00
last      2018-12-31 00:00:00
Name: release_date, dtype: object

In [37]:
tn_2010_2018.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,international_gross,profit
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,804600000,635063875
3,4,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,944008095,1072413963
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,696540365,999721747
5,6,2015-12-18,Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,1116648995,1747311220
6,7,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,1369318718,1748134200

In [38]:
#sorting tn data set by profit, descending
tn_2010_2018 = tn_2010_2018.sort_values(by='profit', ascending=False)
tn_2010_2018.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,international_gross,profit
6,7,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,1369318718,1748134200
5,6,2015-12-18,Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,1116648995,1747311220
33,34,2015-06-12,Jurassic World,215000000,652270625,1648854864,996584239,1433854864
66,67,2015-04-03,Furious 7,190000000,353007020,1518722794,1165715774,1328722794
26,27,2012-05-04,The Avengers,225000000,623279547,1517935897,894656350,1292935897

In [39]:
#created data set of top 100 most profitable movies from TN data set
tn100 = tn_2010_2018.head(100)
tn100

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,international_gross,profit
6,7,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,1369318718,1748134200
5,6,2015-12-18,Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,1116648995,1747311220
33,34,2015-06-12,Jurassic World,215000000,652270625,1648854864,996584239,1433854864
66,67,2015-04-03,Furious 7,190000000,353007020,1518722794,1165715774,1328722794
26,27,2012-05-04,The Avengers,225000000,623279547,1517935897,894656350,1292935897
...,...,...,...,...,...,...,...,...
3517,18,2012-05-25,Les Intouchables,10800000,13182281,484873045,471690764,474073045
198,99,2014-06-13,How to Train Your Dragon 2,145000000,177002924,614586270,437583346,469586270
776,77,2018-07-13,Hotel Transylvania 3: Summer Vacation,65000000,167500092,527079962,359579870,462079962
319,20,2011-07-29,The Smurfs,110000000,142614158,563749323,421135165,453749323
59,60,2018-11-16,Fantastic Beasts: The Crimes of Grindelwald,200000000,159555901,652220086,492664185,452220086

In [40]:
tn100.info()
tn100.describe()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 6 to 59
Data columns (total 8 columns):
id                     100 non-null int64
release_date           100 non-null datetime64[ns]
movie                  100 non-null object
production_budget      100 non-null int64
domestic_gross         100 non-null int64
worldwide_gross        100 non-null int64
international_gross    100 non-null int64
profit                 100 non-null int64
dtypes: datetime64[ns](1), int64(6), object(1)
memory usage: 7.0+ KB

,id,production_budget,domestic_gross,worldwide_gross,international_gross,profit
count,100.000000,1.000000e+02,1.000000e+02,1.000000e+02,1.000000e+02,1.000000e+02
mean,45.270000,1.615642e+08,3.118346e+08,8.960604e+08,5.842258e+08,7.344962e+08
std,26.738485,7.088174e+07,1.425826e+08,3.000080e+08,2.035347e+08,2.666163e+08
min,2.000000,1.080000e+07,3.229457e+06,4.848730e+08,1.972000e+08,4.522201e+08
25%,23.750000,1.190000e+08,2.197858e+08,6.861251e+08,4.378900e+08,5.401982e+08
50%,42.000000,1.625000e+08,2.815055e+08,8.117681e+08,5.312258e+08,6.519457e+08
75%,62.000000,2.000000e+08,3.650172e+08,1.037462e+09,6.906684e+08,8.690170e+08
max,100.000000,4.106000e+08,9.366622e+08,2.053311e+09,1.369319e+09,1.748134e+09

In [41]:
#average budget of 100 most profitable movies
np.mean(tn100['production_budget'])

161564200.0

In [42]:
#data set of 100 least profitable movies
tnbottom100 = tn.tail(100)

In [43]:
#average budget of 100 least profitable movies
np.mean(tnbottom100['production_budget'])

45188.0

In [44]:
#merged principals and name data sets based on nconst column
imdbmerge = pd.merge(imdbprincipals, imdbname, on = 'nconst')
imdbmerge.head()

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]",Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064"
1,tt0111414,2,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414"
2,tt5573596,5,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414"
3,tt0111414,3,nm3739909,producer,producer,NaN,Barry Porter-Robinson,NaN,NaN,"producer,art_department","tt0290884,tt0101374,tt0111414,tt1566940"
4,tt0323808,10,nm0059247,editor,NaN,NaN,Sean Barton,1944.0,NaN,"editor,editorial_department,assistant_director","tt0402910,tt1022883,tt0086190,tt0490181"

In [45]:
#then merged data set with basics data set based on tconst column
imdbfinal = pd.merge(imdbmerge, imdbbasics, on = 'tconst')
imdbfinal.head()

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]",Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064",A Thin Life,A Thin Life,2018,75.0,Comedy
1,tt0111414,2,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",A Thin Life,A Thin Life,2018,75.0,Comedy
2,tt0111414,3,nm3739909,producer,producer,NaN,Barry Porter-Robinson,NaN,NaN,"producer,art_department","tt0290884,tt0101374,tt0111414,tt1566940",A Thin Life,A Thin Life,2018,75.0,Comedy
3,tt5573596,5,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy
4,tt5573596,4,nm0000476,actress,NaN,NaN,Sally Kirkland,1941.0,NaN,"actress,producer,miscellaneous","tt0315327,tt0092569,tt3216866,tt0102138",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy

In [46]:
#changed column name to movie to prepare for merge with TN data set
imdbfinal = imdbfinal.rename(columns = {'primary_title': 'movie'})
imdbfinal.head()

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles,movie,original_title,start_year,runtime_minutes,genres
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]",Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064",A Thin Life,A Thin Life,2018,75.0,Comedy
1,tt0111414,2,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",A Thin Life,A Thin Life,2018,75.0,Comedy
2,tt0111414,3,nm3739909,producer,producer,NaN,Barry Porter-Robinson,NaN,NaN,"producer,art_department","tt0290884,tt0101374,tt0111414,tt1566940",A Thin Life,A Thin Life,2018,75.0,Comedy
3,tt5573596,5,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy
4,tt5573596,4,nm0000476,actress,NaN,NaN,Sally Kirkland,1941.0,NaN,"actress,producer,miscellaneous","tt0315327,tt0092569,tt3216866,tt0102138",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy

In [47]:
#Merging TN dataframe with IMDB merged dataframe based on movie column
tnfinal = pd.merge(imdbfinal, tn100, on = 'movie', how = 'right')
tnfinal.head()

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,...,start_year,runtime_minutes,genres,id,release_date,production_budget,domestic_gross,worldwide_gross,international_gross,profit
0,tt5463162,2.0,nm0000982,actor,NaN,"[""Cable""]",Josh Brolin,1968.0,NaN,"actor,producer,writer",...,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557
1,tt5463162,6.0,nm1014201,writer,written by,NaN,Rhett Reese,NaN,NaN,"writer,producer,miscellaneous",...,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557
2,tt5463162,7.0,nm1116660,writer,written by,NaN,Paul Wernick,NaN,NaN,"producer,writer,director",...,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557
3,tt5463162,1.0,nm0005351,actor,NaN,"[""Wade Wilson"",""Deadpool"",""Voice of Juggernaut""]",Ryan Reynolds,1976.0,NaN,"actor,producer,soundtrack",...,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557
4,tt5463162,10.0,nm1334526,producer,producer,NaN,Simon Kinberg,1973.0,NaN,"producer,writer,director",...,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557

In [48]:
#removed any unneeded columns from the data set
tnfinal = tnfinal.drop(columns=['job', 'characters', 'birth_year', 'death_year', 'primary_profession', 'original_title'])
tnfinal

,tconst,ordering,nconst,category,primary_name,known_for_titles,movie,start_year,runtime_minutes,genres,id,release_date,production_budget,domestic_gross,worldwide_gross,international_gross,profit
0,tt5463162,2.0,nm0000982,actor,Josh Brolin,"tt4154756,tt1175491,tt0477348,tt1791528",Deadpool 2,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557
1,tt5463162,6.0,nm1014201,writer,Rhett Reese,"tt5442430,tt1156398,tt1583421,tt1431045",Deadpool 2,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557
2,tt5463162,7.0,nm1116660,writer,Paul Wernick,"tt1431045,tt5442430,tt1156398,tt1583421",Deadpool 2,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557
3,tt5463162,1.0,nm0005351,actor,Ryan Reynolds,"tt5463162,tt1462758,tt1431045,tt0458525",Deadpool 2,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557
4,tt5463162,10.0,nm1334526,producer,Simon Kinberg,"tt1502712,tt3315342,tt1877832,tt3659388",Deadpool 2,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1027,NaN,NaN,NaN,NaN,NaN,NaN,"The Twilight Saga: Breaking Dawn, Part 1",NaN,NaN,NaN,57,2011-11-18,127500000,281287133,689420051,408132918,561920051
1028,NaN,NaN,NaN,NaN,NaN,NaN,Mission: ImpossibleâGhost Protocol,NaN,NaN,NaN,98,2011-12-16,145000000,209397903,694713230,485315327,549713230
1029,NaN,NaN,NaN,NaN,NaN,NaN,Mission: ImpossibleâRogue Nation,NaN,NaN,NaN,68,2015-07-31,150000000,195042377,688858992,493816615,538858992
1030,NaN,NaN,NaN,NaN,NaN,NaN,Mei Ren Yu,NaN,NaN,NaN,42,2016-02-19,60720000,3229457,554516671,551287214,493796671
1031,NaN,NaN,NaN,NaN,NaN,NaN,Les Intouchables,NaN,NaN,NaN,18,2012-05-25,10800000,13182281,484873045,471690764,474073045

In [49]:
#cleaned the data set by dropping NaN values from the dataset- there was a very small percentage of NaN values in the data set, so the removal of them did not skew the data
tnfinal = tnfinal.dropna()
tnfinal

,tconst,ordering,nconst,category,primary_name,known_for_titles,movie,start_year,runtime_minutes,genres,id,release_date,production_budget,domestic_gross,worldwide_gross,international_gross,profit
0,tt5463162,2.0,nm0000982,actor,Josh Brolin,"tt4154756,tt1175491,tt0477348,tt1791528",Deadpool 2,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557
1,tt5463162,6.0,nm1014201,writer,Rhett Reese,"tt5442430,tt1156398,tt1583421,tt1431045",Deadpool 2,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557
2,tt5463162,7.0,nm1116660,writer,Paul Wernick,"tt1431045,tt5442430,tt1156398,tt1583421",Deadpool 2,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557
3,tt5463162,1.0,nm0005351,actor,Ryan Reynolds,"tt5463162,tt1462758,tt1431045,tt0458525",Deadpool 2,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557
4,tt5463162,10.0,nm1334526,producer,Simon Kinberg,"tt1502712,tt3315342,tt1877832,tt3659388",Deadpool 2,2018.0,119.0,"Action,Adventure,Comedy",15,2018-05-18,110000000,324591735,786680557,462088822,676680557
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1014,tt1386697,3.0,nm3053338,actress,Margot Robbie,"tt1386697,tt0918940,tt0993846,tt5580036",Suicide Squad,2016.0,123.0,"Action,Adventure,Fantasy",100,2016-08-05,175000000,325100054,746059887,420959833,571059887
1015,tt1386697,2.0,nm0001467,actor,Jared Leto,"tt0790636,tt1386697,tt0180093,tt0120863",Suicide Squad,2016.0,123.0,"Action,Adventure,Fantasy",100,2016-08-05,175000000,325100054,746059887,420959833,571059887
1016,tt1386697,8.0,nm0837112,producer,Richard Suckle,"tt0963178,tt0119099,tt0451279,tt1800241",Suicide Squad,2016.0,123.0,"Action,Adventure,Fantasy",100,2016-08-05,175000000,325100054,746059887,420959833,571059887
1017,tt1386697,10.0,nm1664042,cinematographer,Roman Vasyanov,"tt1386697,tt1488606,tt2713180,tt1855199",Suicide Squad,2016.0,123.0,"Action,Adventure,Fantasy",100,2016-08-05,175000000,325100054,746059887,420959833,571059887
1018,tt1386697,6.0,nm1694619,writer,John Ostrander,"tt8050266,tt1641384,tt4324302,tt6334354",Suicide Squad,2016.0,123.0,"Action,Adventure,Fantasy",100,2016-08-05,175000000,325100054,746059887,420959833,571059887

In [50]:
tncategory = tnfinal.groupby('category').size()
tncategory

category
actor                  273
actress                123
cinematographer         15
composer                44
director               127
editor                  12
producer               108
production_designer      3
self                     5
writer                 288
dtype: int64

In [51]:
tnnames = tnfinal.groupby('primary_name').size()
print(tnnames.value_counts())
tnnames

1     586
2      97
3      36
4      18
5       3
10      1
7       1
6       1
dtype: int64

primary_name
Aarif Rahman         1
Abigail Isom         1
Adam Green           1
Adam Sandler         1
Adil Hussain         1
                    ..
Yiu-Wing Chan        1
Zach Galifianakis    1
Zack Snyder          2
Zak Penn             1
Zoe Saldana          1
Length: 743, dtype: int64

In [52]:
tnnamessorted = tnnames.sort_values(ascending=False)
tnnamessorted

primary_name
Stan Lee             10
Jack Kirby            7
Robert Downey Jr.     6
Dwayne Johnson        5
Chris Evans           5
                     ..
Lucy Boynton          1
Louis C.K.            1
Lori Forte            1
Lindsey Collins       1
Aarif Rahman          1
Length: 743, dtype: int64

In [53]:
tnnc = tnfinal.groupby(['primary_name', 'category']).size()
tnnc

primary_name       category
Aarif Rahman       actor       1
Abigail Isom       actress     1
Adam Green         director    1
Adam Sandler       actor       1
Adil Hussain       actor       1
                              ..
Zach Galifianakis  actor       1
Zack Snyder        director    1
                   writer      1
Zak Penn           writer      1
Zoe Saldana        actress     1
Length: 751, dtype: int64

In [54]:
#sorted the names in descending order based on how many times each name appears in the data set
tnncsorted = tnnc.sort_values(ascending=False)
tnncsorted

primary_name             category
Stan Lee                 writer      10
Jack Kirby               writer       7
Robert Downey Jr.        actor        6
Dwayne Johnson           actor        5
Janet Healy              producer     5
                                     ..
Lucy Rodriguez Sandoval  actress      1
Lucy Davis               actress      1
Lucy Boynton             actress      1
Louis C.K.               actor        1
Aarif Rahman             actor        1
Length: 751, dtype: int64

In [55]:
#split the genres to figure out how many individual appearances each genre makes in the data set
tngenres = tnfinal.genres.str.split(",",expand=True)

print(tngenres.groupby(0).size())
print(tngenres.groupby(1).size())
tngenres.groupby(2).size()

0
Action         500
Adventure      290
Animation       29
Biography       20
Comedy          30
Crime           10
Documentary     12
Drama           30
Family          24
Fantasy         17
Horror          19
Sci-Fi           7
Thriller        10
dtype: int64
1
Adventure      430
Animation      170
Biography       10
Comedy          20
Crime           30
Documentary     10
Drama          104
Family          40
Fantasy         56
Musical          7
Mystery         10
Romance         20
Sci-Fi          20
Thriller        20
dtype: int64

2
Animation     40
Comedy       230
Drama         20
Family        50
Fantasy      140
History       10
Music         10
Musical       16
Romance       10
Sci-Fi       240
Sport         14
Thriller      80
dtype: int64

In [56]:
#created dictionary of genres in tn dataset to show frequency of how many times these genres appeared
tngenresdict = {'Action': 500, 'Adventure': 290 + 430, 'Animation': 29 + 170 + 40, 'Biography': 17 + 10, 'Comedy': 30 + 20 + 230, 'Crime': 10 + 30, 'Documentary': 11 + 7, 'Drama': 30 + 104 + 20, 'Family': 24 + 40 + 50, 'Fantasy': 17 + 40 + 140, 'History': 7, 'Horror': 19, 'Music': 10, 'Musical': 7 + 16, 'Mystery': 10, 'Romance': 20 + 10, 'Sci-Fi': 7 + 20 + 240, 'Sport': 14, 'Thriller': 10 + 20 + 80}
tngenresdict

{'Action': 500,
 'Adventure': 720,
 'Animation': 239,
 'Biography': 27,
 'Comedy': 280,
 'Crime': 40,
 'Documentary': 18,
 'Drama': 154,
 'Family': 114,
 'Fantasy': 197,
 'History': 7,
 'Horror': 19,
 'Music': 10,
 'Musical': 23,
 'Mystery': 10,
 'Romance': 30,
 'Sci-Fi': 267,
 'Sport': 14,
 'Thriller': 110}